So I do see this from the plan, but it's unclear what could've caused that:
```
  # module.project-ci-lb-http.module.project-factory.google_project.main is tainted, so must be replaced
-/+ resource "google_project" "main" {
      ~ app_engine          = [] -> (known after apply)
        auto_create_network = false
        billing_account     = "018226-824C2D-4372EC"
        folder_id           = "65631194888"
      ~ id                  = "ci-int-lb-http-5696" -> (known after apply)
      - labels              = {} -> null
        name                = "ci-int-lb-http"
      ~ number              = "1073268911910" -> (known after apply)
      + org_id              = (known after apply)
      + policy_data         = (known after apply)
      + policy_etag         = (known after apply)
        project_id          = "ci-int-lb-http-5696"
      + skip_delete         = (known after apply)
    }
```

Any chance you manually tainted the project?